<a href="https://colab.research.google.com/github/dhivyakarthik/data-science/blob/main/AdvPython_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [8]:
import pandas as pd

In [9]:
empty_series = pd.Series()
empty_series.dtype #dtype('0')
empty_series.ndim # 1
empty_series.shape # (0,)
empty_series.size  # 0
empty_series.name
empty_series.values

array([], dtype=object)

In [10]:
named_series = pd.Series()
named_series = pd.Series(data = ['Ashok', 'Kumar', 18, 183],
                         index = ['Forename', 'Surname', 'Age', 'Height'],
                         name = 'Student Info')
named_series

Forename    Ashok
Surname     Kumar
Age            18
Height        183
Name: Student Info, dtype: object

In [11]:
named_series.size # 4
named_series.shape # (4,)
named_series.ndim # 1
named_series.index #Index(['Forename', 'Surname', 'Age', 'Height'], dtype='object')
named_series.values #array(['Ashok', 'Kumar', 18, 183], dtype=object)
named_series.name #Student Info

'Student Info'

In [12]:
my_series = pd.Series({'A': 1, 'B': 2, 'C': 3, 'D': 4})
my_series

A    1
B    2
C    3
D    4
dtype: int64

In [13]:
my_series = pd.Series(data = [32, 33, 30, 29, 36],
                      index = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri'],
                      name = 'Peak Temperature')
my_series

Mon    32
Tue    33
Wed    30
Thu    29
Fri    36
Name: Peak Temperature, dtype: int64

In [14]:
my_series.iloc[0] # 32
my_series['Tue'] #33
my_series.iloc[1:3] # Tue and Wed
my_series.loc['Tue': 'Thu'] # Tue, Wed, Thu
sorted_series= my_series.sort_values() #sort based on Temperature
sorted_series
my_series.sort_index() #sort based on week days

Fri    36
Mon    32
Thu    29
Tue    33
Wed    30
Name: Peak Temperature, dtype: int64

In [16]:
my_series.loc[(my_series > 33) & (my_series > 30)]

Fri    36
Name: Peak Temperature, dtype: int64

In [36]:
my_series.loc[my_series.isin([28, 29, 30])]
my_series.loc[~my_series.isin([28, 29, 30])]
my_series.iloc[[0, 0, 4, 2]]
my_series.loc[['Mon', 'Wed', 'Fri', 'Fri']]

Mon    32
Wed    30
Fri    36
Fri    36
Name: Peak Temperature, dtype: int64

In [17]:
phone_steps = pd.Series(data = [6000, 7400, 6750, 8000, 5500],
                        index = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri'],
                        name = 'Phone')
smartwatch_steps = pd.Series(data = [5500, 4750, 6750],
                             index = ['Mon', 'Wed', 'Fri'],
                             name = 'Smart Watch')

phone_steps
smartwatch_steps
total_steps = phone_steps + smartwatch_steps
total_steps

Fri    12250.0
Mon    11500.0
Thu        NaN
Tue        NaN
Wed    11500.0
dtype: float64

In [6]:
phone_steps.add(smartwatch_steps, fill_value = 0)

Fri    12250.0
Mon    11500.0
Thu     8000.0
Tue     7400.0
Wed    11500.0
dtype: float64

In [18]:
total_steps.fillna(99999)

Fri    12250.0
Mon    11500.0
Thu    99999.0
Tue    99999.0
Wed    11500.0
dtype: float64

In [19]:
total_steps

Fri    12250.0
Mon    11500.0
Thu        NaN
Tue        NaN
Wed    11500.0
dtype: float64

In [20]:
total_steps.isna()

Fri    False
Mon    False
Thu     True
Tue     True
Wed    False
dtype: bool

In [23]:
tmp = total_steps.fillna(12345, inplace = True)
tmp
total_steps

Fri    12250.0
Mon    11500.0
Thu    12345.0
Tue    12345.0
Wed    11500.0
dtype: float64

In [24]:
total_steps = phone_steps + smartwatch_steps
total_steps.dropna()

Fri    12250.0
Mon    11500.0
Wed    11500.0
dtype: float64

In [26]:
what_struct = total_steps.reset_index()
what_struct

  index        0
0   Fri  12250.0
1   Mon  11500.0
2   Thu      NaN
3   Tue      NaN
4   Wed  11500.0

In [27]:
still_a_series = total_steps.reset_index(drop = True)
still_a_series

0    12250.0
1    11500.0
2        NaN
3        NaN
4    11500.0
dtype: float64